luozhehao/xiaozhi-linux-imx6ull/source/src/media/esp32_music.cpp
                    final_pcm_data = mono_buffer.data();
                    final_sample_count = mono_samples;

                     Logger::info(  "Converted stereo to mono: %d -> %d samples", 
                            stereo_samples, mono_samples);
                } else if (mp3_frame_info_.nChans == 1) {
                    // 已经是单声道，无需转换
                     Logger::info(  "Already mono audio: %d samples", final_sample_count);
                } else {
                    Logger::warning(  "Unsupported channel count: %d, treating as mono", 
                            mp3_frame_info_.nChans);
                }
                
                // 创建AudioStreamPacket
                AudioStreamPacket packet;
                packet.sample_rate = mp3_frame_info_.samprate;
                packet.frame_duration = 60;  // 使用Application默认的帧时长
                packet.timestamp = 0;
                
                // 将int16_t PCM数据转换为uint8_t字节数组
                size_t pcm_size_bytes = final_sample_count * sizeof(int16_t);
                packet.payload.resize(pcm_size_bytes);
                memcpy(packet.payload.data(), final_pcm_data, pcm_size_bytes);

                if (final_pcm_data_fft == nullptr) {
                    // final_pcm_data_fft = (int16_t*)heap_caps_malloc(
                    //     final_sample_count * sizeof(int16_t),
                    //     MALLOC_CAP_SPIRAM
                    // );
                    final_pcm_data_fft = (int16_t*)malloc(
                        final_sample_count * sizeof(int16_t)
                    );
                }
                
                memcpy(
                    final_pcm_data_fft,
                    final_pcm_data,
                    final_sample_count * sizeof(int16_t)
                );
                
                 Logger::info(  "Sending %d PCM samples (%d bytes, rate=%d, channels=%d->1) to Application", 
                        final_sample_count, pcm_size_bytes, mp3_frame_info_.samprate, mp3_frame_info_.nChans);
                
                // 发送到Application的音频解码队列
                app.AddAudioData(std::move(packet));
                total_played += pcm_size_bytes;
                
                // 打印播放进度
                if (total_played % (128 * 1024) == 0) {
                    Logger::info(  "Played %d bytes, buffer size: %d", total_played, buffer_size_);
                }
            }
            
        } else {
            // 解码失败
            Logger::warning(  "MP3 decode failed with error: %d", decode_result);
            
            // 跳过一些字节继续尝试
            if (bytes_left > 1) {
                read_ptr++;
                bytes_left--;
            } else {
                bytes_left = 0;
            }
        }
    }
    
    // 清理
    if (mp3_input_buffer) {
        // heap_caps_free(mp3_input_buffer);
        free(mp3_input_buffer);
    }
    
    // 播放结束时进行基本清理，但不调用StopStreaming避免线程自我等待
    Logger::info(  "Audio stream playback finished, total played: %d bytes", total_played);
    Logger::info(  "Performing basic cleanup from play thread");
    
    // 停止播放标志
    is_playing_ = false;
    
    // // 只在频谱显示模式下才停止FFT显示
    // if (display_mode_ == DISPLAY_MODE_SPECTRUM) {
    //     auto& board = Board::GetInstance();
    //     auto display = board.GetDisplay();
    //     if (display) {
    //         display->stopFft();
    //         Logger::info(  "Stopped FFT display from play thread (spectrum mode)");
    //     }
    // } else {
    //     Logger::info(  "Not in spectrum mode, skipping FFT stop");
    // }
}

// 清空音频缓冲区
void Esp32Music::ClearAudioBuffer() {
    std::lock_guard<std::mutex> lock(buffer_mutex_);
    
    while (!audio_buffer_.empty()) {
        AudioChunk chunk = audio_buffer_.front();
        audio_buffer_.pop();
        if (chunk.data) {
            // heap_caps_free(chunk.data);
            free(chunk.data);
        }
    }
    
    buffer_size_ = 0;
    Logger::info(  "Audio buffer cleared");
}

// 初始化MP3解码器
bool Esp32Music::InitializeMp3Decoder() {
    mp3_decoder_ = MP3InitDecoder();
    if (mp3_decoder_ == nullptr) {
        Logger::error(  "Failed to initialize MP3 decoder");
        mp3_decoder_initialized_ = false;
        return false;
    }
    
    mp3_decoder_initialized_ = true;
    Logger::info(  "MP3 decoder initialized successfully");
    return true;
}

// 清理MP3解码器
void Esp32Music::CleanupMp3Decoder() {
    if (mp3_decoder_ != nullptr) {
        MP3FreeDecoder(mp3_decoder_);
        mp3_decoder_ = nullptr;
    }
    mp3_decoder_initialized_ = false;
    Logger::info(  "MP3 decoder cleaned up");
}

// 重置采样率到原始值
void Esp32Music::ResetSampleRate() {
    // auto& board = Board::GetInstance();
    // auto codec = board.GetAudioCodec();
    auto& codec = AudioService::GetInstance().GetAudioPlayer();
    // if (codec && codec.original_output_sample_rate() > 0 && 
    if (codec.original_output_sample_rate() > 0 && 
        codec.output_sample_rate() != codec.original_output_sample_rate()) {
        Logger::info(  "重置采样率：从 %d Hz 重置到原始值 %d Hz", 
                codec.output_sample_rate(), codec.original_output_sample_rate());
        if (codec.SetOutputSampleRate(-1)) {  // -1 表示重置到原始值
            Logger::info(  "成功重置采样率到原始值: %d Hz", codec.output_sample_rate());
        } else {
            Logger::warning(  "无法重置采样率到原始值");
        }
    }
}

// 跳过MP3文件开头的ID3标签
size_t Esp32Music::SkipId3Tag(uint8_t* data, size_t size) {
    if (!data || size < 10) {
        return 0;
    }
    
    // 检查ID3v2标签头 "ID3"
    if (memcmp(data, "ID3", 3) != 0) {
        return 0;
    }
    
    // 计算标签大小（synchsafe integer格式）
    uint32_t tag_size = ((uint32_t)(data[6] & 0x7F) << 21) |
                        ((uint32_t)(data[7] & 0x7F) << 14) |
                        ((uint32_t)(data[8] & 0x7F) << 7)  |
                        ((uint32_t)(data[9] & 0x7F));
    
    // ID3v2头部(10字节) + 标签内容
    size_t total_skip = 10 + tag_size;
    
    // 确保不超过可用数据大小
    if (total_skip > size) {
        total_skip = size;
    }
    
    Logger::info(  "Found ID3v2   skipping %u bytes", (unsigned int)total_skip);
    return total_skip;
}

// 下载歌词
bool Esp32Music::DownloadLyrics(const std::string& lyric_url) {
    Logger::info(  "Downloading lyrics from: %s", lyric_url.c_str());
    
    // 检查URL是否为空
    if (lyric_url.empty()) {
        Logger::error(  "Lyric URL is empty!");
        return false;
    }
    
    // 添加重试逻辑
    const int max_retries = 3;
    int retry_count = 0;
    bool success = false;
    std::string lyric_content;
    std::string current_url = lyric_url;
    int redirect_count = 0;
    const int max_redirects = 5;  // 最多允许5次重定向
    
    while (retry_count < max_retries && !success && redirect_count < max_redirects) {
        if (retry_count > 0) {
            Logger::info(  "Retrying lyric download (attempt %d of %d)", retry_count + 1, max_retries);
            // 重试前暂停一下
            std::this_thread::sleep_for(std::chrono::milliseconds(500));
        }
        
        // 使用Board提供的HTTP客户端
        auto network = Board::GetInstance().GetNetwork();
        // EspNetwork network;
        auto http = network->CreateHttp(0);
        

        if (!http) {
            Logger::error(  "Failed to create HTTP client for lyric download");
            retry_count++;
            continue;
        }
        
        // 设置基本请求头
        http->SetHeader("User-Agent", "ESP32-Music-Player/1.0");
        http->SetHeader("Accept", "text/plain");
        
